000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/Отметки_timestamp/Отметки_timestamp.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Отметки_timestamp</name>
  <resources>
    <name>КодИзменения</name>
    <comment>NAV: timestamp</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/Отметки_timestamp/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//	LNK 12.12.2023 05:28:41
Функция ПолучитьОтметку(Ключ)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаОтметок.КодИзменения КАК КодИзменения
	|ИЗ
	|	РегистрСведений.Отметки_timestamp КАК ТаблицаОтметок
	|ГДЕ
	|	ТаблицаОтметок.Ключ = &Ключ"
	);
	Запрос.УстановитьПараметр("Ключ", СокрЛП(Ключ));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	КодИзменения = "0";

	Если НЕ РезультатЗапроса.Пустой() Тогда

		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();

		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Выборка.КодИзменения) Тогда

			КодИзменения = Выборка.КодИзменения;

		КонецЕсли;

	КонецЕсли;
	
	Возврат КодИзменения;

КонецФункции

//	LNK 12.12.2023 05:45:18
Процедура УстановитьОтметку(Ключ, КодИзменения)	Экспорт

	Если НЕ ПустаяСтрока(Ключ) И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(КодИзменения) Тогда

		Если НЕ ПривилегированныйРежим() Тогда

			УстановитьПривилегированныйРежим(Истина);

		КонецЕсли;

		НаборЗаписей = РегистрыСведений.Отметки_timestamp.СоздатьНаборЗаписей();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;

		НаборЗаписей.Отбор.Ключ.Установить(Ключ);

		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.Ключ = НаборЗаписей.Отбор.Ключ.Значение;
		ЗаписьНабора.КодИзменения  = СокрЛП(КодИзменения);
		ЗаписьНабора.ДатаИзменения = ТекущаяДата();

		НаборЗаписей.Записать();

	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
	
#КонецЕсли
